#include <OneWire.h>
 
OneWire ds(10);// Определяем пин подключения к ключу

//A 0 0 12 F1 4D 3F 1  
//EB 0 0 0 2 43 B5 37

// 3 etaj Maaaarin 8B 0 0 6 88 52 33 1 
//byte aaa[8] = {0x0A, 0x00,0x00,0x12,0xF1,0x4D,0x3F,0x01};// Массив известного ключа
//byte aaa[8] = {0x01,0x3F,0x4D,0xF1,0x12,0x00,0x00,0x0A,};// Массив известного ключа
byte aaa[8] = {0x37,0xB5,0x43,0x02,0x00,0x00,0x00,0xEB,};// Массив известного ключа
byte addr[8]; // Обозначаем массив для чтения ключа из 8 байт

void setup() {
     Serial.begin(9600);// Запускаем порт
}
void loop() {
     if (ds.search(addr)){// Если устройство подключено - считываем
           if(aaa[0] == addr[0] && aaa[1] == addr[1] && aaa[2] == addr[2] // Сравниваем побайтно массивы
                 && aaa[3] == addr[3] && aaa[4] == addr[4] && aaa[5] == addr[5] // Да, это чересчур громоздко,
                 && aaa[6] == addr[6] && aaa[7] == addr[7]){ // зато просто "как кувалда".
                 Serial.println("OK");// Если код совпал пишем ОК!
                 }
           else {
                Serial.println("NO!");// Если несовпадение пишем NO!
                }
    for(int i=7; i>-1; i--){// Запускаем цикл печати данных из массива.
    Serial.print(addr[i], HEX);// Печатаем нужный байт в шестнадцатеричном виде
    Serial.print(" ");}// Печатаем пробел
    Serial.println();// В конце цикла переводим строку
    ds.reset_search();}} // Сбрасываем устройство
